backend/app/controllers/admins_controller.rb

SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        current_admin = Admin.find_by_id(session[:admin_id])

INSERT INTO "admins" ("name", "username", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
        admin = Admin.create!(admin_params)