backend/app/controllers/application_controller.rb

SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def current_admin
    @current_admin ||= Admin.find_by_id(session[:admin_id])