backend/app/controllers/event_lists_controller.rb

SELECT "event_lists".* FROM "event_lists" WHERE "event_lists"."admin_id" = ?  [["admin_id", 1]]
---
    def show
        render json: EventList.where(admin_id: params[:admin_id]),  status: :ok