backend/app/controllers/event_lists_controller.rb

    def show
        render json: EventList.find(params[:id]),  status: :ok
---
SELECT "event_lists".* FROM "event_lists" WHERE "event_lists"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

    def create
        group = EventList.create!(eventList_params)
---
INSERT INTO "events" ("title", "activity", "description", "location", "starts", "ends", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "event_lists" ("title", "eventType", "admin_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "test"], ["eventType", "test"], ["admin_id", 1], ["event_id", 7], ["created_at", "2022-09-13 20:46:36.028529"], ["updated_at", "2022-09-13 20:46:36.028529"]]

    def update
        eventList = EventList.find(params[:id])
        eventList.update!(eventList_params)
---
SELECT "event_lists".* FROM "event_lists" WHERE "event_lists"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]
UPDATE "event_lists" SET "eventType" = ?, "updated_at" = ? WHERE "event_lists"."id" = ?  [["eventType", "Reminder"], ["updated_at", "2022-09-15 20:43:25.404354"], ["id", 29]]

    def destroy
        EventList.find(params[:id]).destroy!
---
DELETE FROM "event_lists" WHERE "event_lists"."id" = ?  [["id", 3]]
SELECT "event_lists".* FROM "event_lists" WHERE "event_lists"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]