backend/app/controllers/events_controller.rb

    def create

        event = Event.create!(event_params)
---
INSERT INTO "events" ("title", "activity", "description", "location", "starts", "ends", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def update
        event = Event.find(params[:id])
        event.update!(event_params)
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 35], ["LIMIT", 1]]
UPDATE "events" SET "description" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["description", "Make it so users can edit notes. It works now!"], ["updated_at", "2022-09-15 16:17:29.120095"], ["id", 35]]