backend/app/controllers/sessions_controller.rb

SELECT "admins".* FROM "admins" WHERE "admins"."username" = ? LIMIT ?  [["username", "CharlesDW"], ["LIMIT", 1]]
---
    def create_admin
        admin = Admin.find_by(username: params[:username])